zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
	                                    wpan_mlme_set_req(macKeyTable,
	                                    INDEX_1,    // Index: 1
	                                    &mac_key_table1);
	                                    wpan_mlme_set_req(macKeyTable,
	                                    INDEX_2,    // Index: 2
	                                    &mac_key_table2);
                                    }
                 break;

             case macKeyTable:
                 {
					/*
					* Sync with beacon frames from our coordinator.
					* Use: bool wpan_mlme_sync_req(uint8_t LogicalChannel,
					*                              uint8_t ChannelPage,
					*                              bool TrackBeacon);
					*
					* This does not lead to an immediate reaction.
					*
					* In case we receive beacon frames from our coordinator
					*including
					* a beacon payload, this is indicated in the callback function
					* usr_mlme_beacon_notify_ind().
					*
					* In case the device cannot find its coordinator or later
					*looses
					* synchronization with its parent, this is indicated in the
					* callback function usr_mlme_sync_loss_ind().
					*/
					if(PIBAttributeIndex == INDEX_2 && app_state == APP_IDLE){
						wpan_mlme_get_req(phyCurrentPage,NO_PIB_INDEX);
				    }
                 }
                 break;

              case macDeviceTableEntries:
                 {
	                 uint8_t mac_dev_table[17] =
	                 {
		                 // DeviceDescriptor
		                 // PANId
		                 (uint8_t)tal_pib.PANId,
		                 (uint8_t)(tal_pib.PANId >> 8),
		                 // Device ShortAddress
		                 (uint8_t)mac_pib.mac_CoordShortAddress,
		                 (uint8_t)(mac_pib.mac_CoordShortAddress >> 8),
		                 // Device ExtAddress
		                 (uint8_t)mac_pib.mac_CoordExtendedAddress,
		                 (uint8_t)(mac_pib.mac_CoordExtendedAddress >> 8),
		                 (uint8_t)(mac_pib.mac_CoordExtendedAddress >> 16),
		                 (uint8_t)(mac_pib.mac_CoordExtendedAddress >> 24),
		                 (uint8_t)(mac_pib.mac_CoordExtendedAddress >> 32),
		                 (uint8_t)(mac_pib.mac_CoordExtendedAddress >> 40),
		                 (uint8_t)(mac_pib.mac_CoordExtendedAddress >> 48),
		                 (uint8_t)(mac_pib.mac_CoordExtendedAddress >> 56),
		                 // FrameCounter
		                 0, 0, 0, 0,
		                 // Exempt
		                 0
	                 };

	                 wpan_mlme_set_req(macDeviceTable,
	                 0,    // Index: 0
	                 &mac_dev_table);
                 }
                 break;

             case macDeviceTable:
                 {
	                 /* Use DSN start value as in ZIP test spec. */
	                 uint8_t new_dsn = 0x0;

	                 wpan_mlme_set_req(macDSN,
	                 NO_PIB_INDEX,
	                 &new_dsn);
                 }
                 break;

              case macDSN:
                 {
	                 /* Use DSN start value as in ZIP test spec. */
	                 uint32_t frame_counter = 1;

	                 wpan_mlme_set_req(macFrameCounter,
	                 NO_PIB_INDEX,
	                 &frame_counter);
                 }
                 break;

              case macFrameCounter:
				 {
					 wpan_mlme_get_req(macKeyTable,deviceShortAddress-1);
				 }
                 break;

                 default:
                 // undesired PIB attribute; restart
                 wpan_mlme_reset_req(true);
                 break;
        }
    }

    /* Keep compiler happy. */
    PIBAttributeIndex = PIBAttributeIndex;
}



#if (MAC_START_REQUEST_CONFIRM == 1)
void usr_mlme_start_conf(uint8_t status)
{
}

#endif  /* (MAC_START_REQUEST_CONFIRM == 1) */

/*
 * Callback function usr_mlme_sync_loss_ind
 *
 * @param LossReason     Reason for synchronization loss.
 * @param PANId          The PAN identifier with which the device lost
 *                       synchronization or to which it was realigned.
 * @param LogicalChannel The logical channel on which the device lost
 *                       synchronization or to which it was realigned.
 * @param ChannelPage    The channel page on which the device lost
 *                       synchronization or to which it was realigned.
 */
void usr_mlme_sync_loss_ind(uint8_t LossReason,
		uint16_t PANId,
		uint8_t LogicalChannel,
		uint8_t ChannelPage)
{
	/*
	 * Once we lost sync this the coordinator we need to re-sync.
	 * Since we the network parameter are not supposed ot change,
	 * use the already known parameters form our coordinator.
	 */
	wpan_mlme_sync_req(LogicalChannel,
			ChannelPage,
			1);

	/* Keep compiler happy. */
	LossReason = LossReason;
	PANId = PANId;
}

/* Alert to indicate something has gone wrong in the application */
static void app_alert(void)
{
	while (1) {
		#if LED_COUNT > 0
		LED_Toggle(LED0);
		#endif

		#if LED_COUNT > 1
		LED_Toggle(LED1);
		#endif

		#if LED_COUNT > 2
		LED_Toggle(LED2);
		#endif

		#if LED_COUNT > 3
		LED_Toggle(LED3);
		#endif

		#if LED_COUNT > 4
		LED_Toggle(LED4);
		#endif

		#if LED_COUNT > 5
		LED_Toggle(LED5);
		#endif

		#if LED_COUNT > 6
		LED_Toggle(LED6);
		#endif

		#if LED_COUNT > 7
		LED_Toggle(LED7);
		#endif
		delay_us(0xFFFF);
	}
}

/*
 * @brief Callback function indicating network search
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void network_search_indication_cb(void *parameter)
{
	LED_Toggle(LED_NWK_SETUP);

	/* Re-start timer again. */
	sw_timer_start(APP_TIMER,
			500000,
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)network_search_indication_cb,
			NULL);

	parameter = parameter; /* Keep compiler happy. */
}

/*
 * @brief Callback function for switching off the LED after data reception
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void rx_data_led_off_cb(void *parameter)
{
	LED_Off(LED_DATA);

	parameter = parameter; /* Keep compiler happy. */
}
